// compute_classic_mt.cpp
#include <string.h>
#include <conio.h>
#include <locale.h>
#include <assert.h>

#define LOG printf

//------------------------------------------
// CLASSIC TURING MACHINE 1936
//------------------------------------------
enum Action
{
    MVL, // Шаг влево
    MVR, // Шаг вправо
    HLT  // Маркер финального состояния (Аппаратный останов)
};

// СТРОКА FSM ТАБЛИЦЫ
struct FSM_entry
{
    int
        current_state,  // ТЕКУЩЕЕ СОСТОЯНИЕ REG_STATE
        in_symbol,      // ВХОДЯЩИЙ СИМВОЛ
        next_state,     // СЛЕДУЮЩЕЕ СОСТОЯНИЕ
        out_symbol,     // ИСХОДЯЩИЙ СИМВОЛ
        action          // СИГНАЛ АППАРАТУРЕ
   ;
};

struct UMT_context
{
    //------------------------------------------
    // EXECUTION CONTEXT
    //------------------------------------------
    int
        // РЕГИСТРЫ МАШИНЫ
        REG_STATE,     // Текущее состояние машины из FSM таблицы
        REG_HEAD_POS,  // Указатель на выбранную ячейку RAM
        // ПАМЯТЬ С ДАННЫМИ
        *RAM           // Вставка "ленты" меняет пространство состояний автомата
    ;
    //------------------------------------------

    //------------------------------------------
    // FSM TABLE
    //------------------------------------------
    FSM_entry *FSM_TABLE;
    int FSM_SIZE;
    //------------------------------------------
};

void UMT_run(UMT_context *CTX)
{
    int is_run = 1;
    while (is_run)
    {
        FSM_entry* step = NULL;

// 1. СЧИТАТЬ СИМВОЛ I_вх С ЛЕНТЫ
        int IN = CTX->RAM[CTX->REG_HEAD_POS];

// 2. ПО ПАРЕ { S_тек, I_вх} НАЙТИ СООТВЕТСТВУЮЩУЮ СТРОКУ В FSM_TABLE
        // Аппаратный поиск кортежа дельта-функции на перфоленте
        for (int i = 0; i < CTX->FSM_SIZE; ++i)
        {
            if ( CTX->FSM_TABLE[i].current_state == CTX->REG_STATE &&
                 CTX->FSM_TABLE[i].in_symbol == IN )
            {
                step = &CTX->FSM_TABLE[i];
                break;
            }
        }

        if(!step)
        {
            LOG("ERR: INTERNAL LOGIC ERROR. UNEXPECTED SYMBOL %d IN STATE %d\n", IN, CTX->REG_STATE);
            return;
        }

// 3. ЗАПИСАТЬ СИМВОЛ I_вых НА ЛЕНТУ
        CTX->RAM[CTX->REG_HEAD_POS] = step->out_symbol;
// 4. ИЗМЕНИТЬ НОМЕР СОСТОЯНИЯ НА S_но.
        CTX->REG_STATE = step->next_state;

// 5. СДВИНУТЬ ПОЗИЦИЮ ГОЛОВКИ СООТВЕТСТВЕННО Action
        switch(step->action)
        {
            case MVL: CTX->REG_HEAD_POS--; break;
            case MVR: CTX->REG_HEAD_POS++; break;
            case HLT: is_run = 0; break;
        }
    }
}
//------------------------------------------

//------------------------------------------
// СТРУКТУРА ФУНКЦИИ СООТВЕТСТВУЕТ ХРЕСТОМАТИЙНОЙ МАШИНЕ ТЬЮРИНГА
//------------------------------------------
/*
МТ №1 для сложения двух чисел в унарной системе счисления.
Числа расположены подряд, чсилу соответствует количество палочек на ленте, разделённых 0: I0 - 1,  II0 - 2, III0 - 3,  ...
*/
void compute_add(int* buffer /* "лента" с данными для обработки (RAM) */)
{
    //------------------------------------------
    // 1. ХРАНИЛИЩЕ ПРОСТРАНСТВА СОСТОЯНИЙ МАШИНЫ (АЛФАВИТЫ, ТАБЛИЦЫ, RAM)
    //------------------------------------------

    /* FSM ДЛЯ СЛОЖЕНИЯ УНАРНЫХ ЧИСЕЛ

ГРАФ АВТОМАТА:

            CURRENT STATE                 [ IN/OUT/ACTION ]

           +--------------+<------------+
(Старт) -->| S_FIND_ZERO  |             | [ 1 / 1 / MVR ]
           +--------------+-------------+
                  |
                  | [ 0 / 1 / MVR ]
                  v
           +--------------+<------------+
           |  S_FIND_END  |             | [ 1 / 1 / MVR ]
           +--------------+-------------+
                  |
                  | [ 0 / 2 / MVL ]
                  v
           +--------------+
           |   S_ERASE    |
           +--------------+
                  |
                  | [ 1 / 0 / MVL ]
                  v
           +--------------+
           |    S_HALT    |-----> [ 1 / 1 / HLT ] (Аппаратный останов)
           +--------------+
     */

    enum State
    {
        S_FIND_ZERO,    // Поиск первого разделительного нуля
        S_FIND_END,     // Поиск нуля перед маркером 2
        S_ERASE,        // Зачистка лишней единицы на хвосте
        S_HALT,         // Финал
    };

    enum Alphabet
    {
        SY_0,
        SY_1,
        SY_2
    };

    FSM_entry FSM_TABLE[] =
    {
        // СОСТОЯНИЕ S_FIND_ZERO: Пропускаем первое число до разделителя
        { S_FIND_ZERO, SY_1, S_FIND_ZERO, SY_1, MVR },
        // Нашли разделительный 0 -> пишем 1 (склеиваем блоки) и идем искать конец строки
        { S_FIND_ZERO, SY_0, S_FIND_END,  SY_1, MVR },

        // СОСТОЯНИЕ S_FIND_END: Пропускаем второе число до концевого нуля
        { S_FIND_END,  SY_1, S_FIND_END,  SY_1, MVR },
        // Нашли концевой 0 -> пишем вместо него маркер 2, разворачивая каретку назад
        { S_FIND_END,  SY_0, S_ERASE,     SY_2, MVL },

        // СОСТОЯНИЕ S_ERASE: Коррекция исходящего числа (стирание лишней единицы)
        // На позиции перед новым маркером 2 гарантированно 1. Затираем её нулем.
        { S_ERASE,     SY_1, S_HALT,      SY_0, MVL },

        // СОСТОЯНИЕ S_HALT: Аппаратный останов
        { S_HALT,      SY_1, S_HALT,      SY_1, HLT }
    };

    UMT_context CTX;

    // НАЧАЛЬНОЕ СОСТОЯНИЕ
    CTX.REG_STATE     = S_FIND_ZERO,
    CTX.REG_HEAD_POS  = 0,
    CTX.RAM           = buffer;
    CTX.FSM_TABLE     = FSM_TABLE;
    CTX.FSM_SIZE      = sizeof(FSM_TABLE) / sizeof(FSM_entry);
    //------------------------------------------

    //------------------------------------------
    // 2. ИСПОЛНИТЕЛЬНЫЕ МЕХАНИЗМЫ (ДВИЖУЩАЯСЯ АППАРАТУРА)
    //------------------------------------------
    UMT_run(&CTX); // Запуск УМТ
    //------------------------------------------
}

//------------------------------------------
// СТРУКТУРА ФУНКЦИИ СООТВЕТСТВУЕТ ХРЕСТОМАТИЙНОЙ МАШИНЕ ТЬЮРИНГА
//------------------------------------------
/*
МТ №2 меняет в буфере 0 на 1, 1 на 0, число 2 - маркер конца буфера
*/
void compute_inverse(int* buffer /* "лента" с данными для обработки (RAM) */)
{
    //------------------------------------------
    // 1. ХРАНИЛИЩЕ ПРОСТРАНСТВА СОСТОЯНИЙ МАШИНЫ (АЛФАВИТЫ, ТАБЛИЦЫ, RAM)
    //------------------------------------------

/*
FSM ДЛЯ ИНВЕРТОРА

+--------------------------------------------+--------------------------------------+
| Синтаксис C99                              | Команды Машины Тьюринга              |
+--------------------------------------------+--------------------------------------+
| if (in == 0)      { RAM[REG_HEAD_POS] = 1; | { S_SCAN, 0, S_SCAN, 1, MVR }        |
|                     REG_HEAD_POS++; }      |                                      |
|--------------------------------------------+--------------------------------------|
| else if (in == 1) { RAM[REG_HEAD_POS] = 0; | { S_SCAN, 1, S_SCAN, 0, MVR }        |
|                     REG_HEAD_POS++; }      |                                      |
|--------------------------------------------+--------------------------------------|
| else if (in == 2) { REG_HEAD_POS--;        | { S_SCAN, 2, S_HALT, CELL_CONST, MVL}|
|                     goto HALT; }           |                                      |
+--------------------------------------------+--------------------------------------+

ГРАФ АВТОМАТА:

            CURRENT STATE                [ IN/OUT/ACTION ]

           +--------------+<-----------+ [ 0 / 1 / MVR ]
(Старт) -->|    S_SCAN    |            | [ 1 / 0 / MVR ]
           +--------------+------------+
                  |
                  | [ 2 / 2 / MVL ]
                  v
           +--------------+<-----------+ [ 0 / 0 / HLT ]
           |    S_HALT    |            | [ 1 / 0 / HLT ]
           +--------------+------------+
*/

    enum State
    {
        S_SCAN,  // Состояние инверсии и сканирования строки
        S_HALT,  // Принимающее финальное состояние останова
    } ;

    enum Alphabet
    {
        SY_0,
        SY_1,
        SY_2
    };

    FSM_entry FSM_TABLE[] =
    {
        // Оператор if реализуется через индексный выбор строки таблицы таблицы по входному символу.

        // СОСТОЯНИЕ S_SCAN: Инверсия чисел (0->1, 1->0)
        { S_SCAN, SY_0, S_SCAN, SY_1, MVR }, // If 0 -> пишем 1, шаг вправо
        { S_SCAN, SY_1, S_SCAN, SY_0, MVR }, // If 1 -> пишем 0, шаг вправо
        { S_SCAN, SY_2, S_HALT, SY_2, MVL }, // If 2 -> уходим в S_HALT (из-за MVL HLT корректно перезапишет RAM)

        // СОСТОЯНИЕ S_HALT: Безусловный аппаратный останов
        { S_HALT, SY_0, S_HALT, SY_0, HLT }, // Если вернулись на ноль -> Останов
        { S_HALT, SY_1, S_HALT, SY_1, HLT }  // Если вернулись на единицу -> Останов
    };

    UMT_context CTX;

    // НАЧАЛЬНОЕ СОСТОЯНИЕ
    CTX.REG_STATE     = S_SCAN,
    CTX.REG_HEAD_POS  = 0,
    CTX.RAM           = buffer;
    CTX.FSM_TABLE     = FSM_TABLE;
    CTX.FSM_SIZE      = sizeof(FSM_TABLE) / sizeof(FSM_entry);
    //------------------------------------------

    //------------------------------------------
    // 2. ИСПОЛНИТЕЛЬНЫЕ МЕХАНИЗМЫ (ДВИЖУЩАЯСЯ АППАРАТУРА)
    //------------------------------------------
    UMT_run(&CTX); // Запуск УМТ
    //------------------------------------------
}

//------------------------------------------
// Проверка целостности автоматов (Integrity Check)
//------------------------------------------
void integrity_check()
{
    //------------------------------------------
    // МТ №1
    //------------------------------------------
    // Тест 1: 2 + 3 (1 1 0 1 1 1 0 2) -> Должно стать 5 единиц (1 1 1 1 1 0 2)
    int buf1[] = {1, 1, 0, 1, 1, 1, 0, 2};
    int exp1[] = {1, 1, 1, 1, 1, 0, 2};
    compute_add(buf1);
    assert(memcmp(buf1, exp1, sizeof(exp1)) == 0);

    // Тест 2: 6 + 2 (1 1 1 1 1 1 0 1 1 0 2) -> Будет 8 единиц (1 1 1 1 1 1 1 1 0 2)
    int buf2[] = {1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 2};
    int exp2[] = {1, 1, 1, 1, 1, 1, 1, 1, 0, 2};
    compute_add(buf2);
    assert(memcmp(buf2, exp2, sizeof(exp2)) == 0);
    //------------------------------------------

    //------------------------------------------
    // МТ №2
    //------------------------------------------
    int buf0[] = {0, 1, 0, 1, 1, 1, 2}; // Инверсия цепочки 0-1-0-1-1-1
    int exp0[] = {1, 0, 1, 0, 0, 0, 2}; // Ожидаемый эталонный слепок RAM

    compute_inverse(buf0);
    assert(memcmp(buf0, exp0, sizeof(exp0)) == 0);
    //------------------------------------------

    LOG("CLASSIC TURING MACHINE INTEGRITY CHECK: PASSED\n");
}
//------------------------------------------

int main()
{
    LOG("CLASSIC TURING MACHINE 1936\n");
    integrity_check();
    getch();
    return 0;
}
