// cpp_virtual_1

#include <conio.h>
#include <locale.h>
#include <stdint.h>

// Функции-помощники
#define LOG printf
#define xFF(x) (int((int64_t(x) % 0xFF)))

// Установить выравнивание размещения структур в памяти в 1 байт (выравнивание отключено)
#pragma pack(push, 1)

//------------------------------------------
// SINGLE INHERITANCE
//------------------------------------------
/*
  Структура объекта 'c' в памяти        Глобальные таблицы вирт. функций
+--------------------------+          +------------------+
| struct C                 |          | C_vtable         |
| +----------------------+ |          +------------------+
| | struct B base        | |  +-----> | &C::f            |
| | +------------------+ | |  |       +------------------+
| | | struct A base    | | |  |
| | | +--------------+ | | |  |       +------------------+
| | | | vptr  +0     |--------+       | B_vtable*        |
| | | +--------------+ | | |          +------------------+
| | | | A::x0 +8     | | | |          | &B::f            |
| | | +--------------+ | | |          +------------------+
| | +------------------+ | |
| | | B::x0 +12        | | |          +------------------+
| | +------------------+ | |          | A_vtable*        |
| +----------------------+ |          +------------------+
| | C::x0 +16              |          | &A::f            |
| +------------------------+          +------------------+

                   * Используется только для объектов типа A, B

                   Размер в памяти int, char* = 4,8
*/

struct A     { int x0; virtual void f() { LOG("A::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } a;
struct B : A { int x0; virtual void f() { LOG("B::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } b;
struct C : B { int x0; virtual void f() { LOG("C::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } c;
//------------------------------------------

//------------------------------------------
// MULTIPLE INHERITANCE
//------------------------------------------
/*
  Структура объекта 'c_' в памяти       Глобальные таблицы вирт. функций
+--------------------------+          +--------------+
| struct C_                |          | C_A_vtable   |
| +----------------------+ |          +--------------+
| | Подобъект A_ +0      | |  +-----> | &C_::f       |--------+
| | +--------------+     | |  |       +--------------+        |
| | | vptr_A_      |----------+                               |
| | +--------------+     | |          +--------------+        |
| | | A_::x0    +8 |     | |          | C_B_vtable   |        |
| +----------------------+ |          +--------------+        |
| | Подобъект B_ +12     | |  +-----> | &Thunk_C_f   |--+     |
| | +--------------+     | |  |       +--------------+  |     |
| | | vptr_B_      |----------+                         V     |
| | +--------------+     | |        +---------------------+   |
| | | B_::x0     +20     | |        | Thunk_C_f:          |   |
| +----------------------+ |        |   this = this - 12; |   |
| | C_::x0       +24       |        |   jmp C_::f;        |-+ |
+--------------------------+        +---------------------+ | |
                                                            V V
                                              +---------------+
                                              | C_::f         |
                                              | ...           |
                                              +---------------+

                   Размер в памяти int, char* = 4,8
*/

struct A_          { int x0; virtual void f() { LOG("A_::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } a_;
struct B_          { int x0; virtual void f() { LOG("B_::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } b_;
struct C_ : A_, B_ { int x0; virtual void f() { LOG("C_::f, this = %d, x0 = %d\n", xFF(this), xFF(x0)); } } c_;
//------------------------------------------

#pragma pack(pop) // Вернуть настройки выравнивания


int main()
{
    a.x0 = 0; b.x0 = 1;
    c.C::A::x0 = 10; c.C::B::x0 = 11; c.C::x0 = 12;
    a_.x0 = 0; b_.x0 = 1;
    c_.C_::A_::x0 = 10; c_.C_::B_::x0 = 11; c_.C_::x0 = 12;

    LOG("SIZEOF int, char* = %d,%d\n\n", sizeof(int), sizeof(char*));

    //------------------------------------------
    // SINGLE INHERITANCE
    //------------------------------------------
    LOG("========= SINGLE INHERITANCE ========= \n");
    LOG("SIZE a,b,c = %d,%d,%d\n", xFF(sizeof(a)),xFF(sizeof(b)),xFF(sizeof(c)));
    LOG("ADDR a,b,c = %d,%d,[%d]\n", xFF(&a),xFF(&b),xFF(&c));
    a.f(); b.f(); c.f();
    LOG("\n--- VAR c ---\n");
    LOG("OFFSET C::A::x0, C::B::x0, C::x0 = %d,%d,%d\n", xFF(&c.C::A::x0)-xFF(&c),xFF(&c.C::B::x0)-xFF(&c),xFF(&c.C::x0)-xFF(&c));
    LOG("ADDR ((A*)&c), ((B*)&c), ((C*)&c) = %d,%d,[%d]\n", xFF((A*)&c), xFF((B*)&c), xFF((C*)&c));
    LOG("VIRTUAL CALL\n");
    ((A*)&c)->f(); ((B*)&c)->f(); ((C*)&c)->f();  // Всегда вызывается последняя реализация виртуального метода
    LOG("DIRECT CALL\n");
    c.C::A::f(); c.C::B::f(); c.C::f();  // Прямой вызов базовых методов
    //------------------------------------------

    //------------------------------------------
    // MULTIPLE INHERITANCE
    //------------------------------------------
    LOG("\n\n========= MULTIPLE INHERITANCE =========\n");

    LOG("SIZE a_,b_,c_ = %d,%d,%d\n", xFF(sizeof(a_)),xFF(sizeof(b_)),xFF(sizeof(c_)));
    LOG("ADDR a_,b_,c_ = %d,%d,[%d]\n", xFF(&a_),xFF(&b_),xFF(&c_));
    a_.f(); b_.f(); c_.f();
    LOG("\n--- VAR c_ ---\n");
    LOG("OFFSET C_::A_::x0, C_::B_::x0, C_::x0 = %d,%d,%d\n", xFF(&c_.C_::A_::x0)-xFF(&c_),xFF(&c_.C_::B_::x0)-xFF(&c_),xFF(&c_.C_::x0)-xFF(&c_));
    LOG("ADDR ((A_*)&c_), ((B_*)&c_), ((C_*)&c_) = %d,%d,[%d]\n", xFF((A_*)&c_), xFF((B_*)&c_), xFF((C_*)&c_));
    LOG("VIRTUAL CALL\n");
    ((A_*)&c_)->f(); ((B_*)&c_)->f(); ((C_*)&c_)->f();  // Всегда вызывается последняя реализация виртуального метода
    LOG("DIRECT CALL\n");
    c_.C_::A_::f(); c_.C_::B_::f(); c_.C_::f();  // Прямой вызов базовых методов
    //------------------------------------------

    getch();
    return 0;
}
