// cpp_struct.cpp

#include <conio.h>
#include <locale.h>

#define LOG printf

struct A { int a0, a1, z0; };
struct B { char b0, b1, z0; };

// C: объявление структуры "вложением" структур
struct C { struct A a; struct B b; } c;

// C++: объявление структуры "списком наследования"
struct Cpp : A, B { } cpp;

int main() {
    setlocale(LC_ALL, "en_US.UTF-8");

    // Синтаксис доступа к полям практически идентичен
    c.a.a0 = 0;      c.b.b0 = 'w';   // C
    cpp.A::a0 = 0;   cpp.B::b0 = 'w'; // C++

    // Размещение структур в памяти идентично
	// (Выведет: 12 12 12 | 3 3 3 | 16 16)
    LOG("%d %d %d\n%d %d %d\n%d %d\n",
        sizeof(A), sizeof(C::a), sizeof(Cpp::A),
        sizeof(B), sizeof(C::b), sizeof(Cpp::B),
        sizeof(C), sizeof(Cpp)
    );

/*
    ОБЪЕКТ 'c' (struct C)                    ОБЪЕКТ 'cpp' (struct Cpp)
Смещение                               Смещение
(байты)                                (байты)
00   +==========================+        00   +==========================+
     | ПОДСТРУКТУРА 'a' (12 b)  |             | БАЗОВЫЙ КЛАСС 'A' (12 b) |
     |==========================|             |==========================|
     | a.a0 (int, 4 bytes)      |             | A::a0 (int, 4 bytes)     |
04   +--------------------------+        04   +--------------------------+
     | a.a1 (int, 4 bytes)      |             | A::a1 (int, 4 bytes)     |
08   +--------------------------+        08   +--------------------------+
     | a.z0 (int, 4 bytes)      |             | A::z0 (int, 4 bytes)     |
     |==========================|             |==========================|
     | ПОДСТРУКТУРА 'b' (4 b)   |             | БАЗОВЫЙ КЛАСС 'B' (4 b)  |
12   +==========================+        12   +==========================+
     | b.b0 (char, 1 byte)      |             | B::b0 (char, 1 byte)     |
13   +--------------------------+        13   +--------------------------+
     | b.b1 (char, 1 byte)      |             | B::b1 (char, 1 byte)     |
14   +--------------------------+        14   +--------------------------+
     | b.z0 (char, 1 byte)      |             | B::z0 (char, 1 byte)     |
15   +--------------------------+        15   +--------------------------+
     | [PAD] выравнивание (1 b) |             | [PAD] выравнивание (1 b) |
16   +--------------------------+        16   +--------------------------+

ОБЩИЙ РАЗМЕР (sizeof) = 16 байт          ОБЩИЙ РАЗМЕР (sizeof) = 16 байт
*/

    // Находим соответствующие А блоки памяти и работаем с ними как с А
    A* c_a      = &c.a;
    A* cpp_a    = (A*)&c;
    (*c_a).a1   = 1;
    (*cpp_a).a1 = 1;

    getch();
    return 0;
}

